<?php

namespace app\helpers;

class WpData
{
  public static function sciences()
  {
    return  [
      'عقيدة' => [
        "الإيمان" => [
          "المراد بالإيمان" => [],
          "زيادة الإيمان ونقصانه" => [],
          "مفهوم الولاء والبراء وأحكامه" => [],
          "مباحث الأسماء والأحكام وحكم مرتكب الكبيرة" => [],
          "مباحث الأسماء والأحكام" => [
            "الشهادة لمعين بجنة أو نار"
          ],
          "منهج أهل السنة والجماعة" => [
            "نواقض الإيمان وأقسامها وأحكامها",
            "العلاقة بين الإسلام والإيمان والإحسان",
            "أركان الإيمان إجمالًا",
            "المراد بعلم العقيدة",
            "تأريخ التأليف فيه وأهم كتبه",
            "خصائص منهج أهل السنة والجماعة في تقرير مسائل الاعتقاد",
            "المصادر الأصلية لتلقي العقيدة (الكتاب-السنة-الإجماع)",
            "المصادر المساندة لتلقي العقيدة (العقل السليم-الفطرة السليمة)",
            "طرق الاستدلال عند أهل السنة والجماعة",
            "التمسك بالسنة والتحذير من البدعة",
            "ثمرات الالتزام بمنهج أهل السنة"
          ]
        ],
        "المدخل إلى علم العقيدة" => [
          "منهج أهل السنة والجماعة" => [
            "نواقض الإيمان وأقسامها وأحكامها",
            "العلاقة بين الإسلام والإيمان والإحسان",
            "أركان الإيمان إجمالًا",
            "المراد بعلم العقيدة",
            "تأريخ التأليف فيه وأهم كتبه",
            "خصائص منهج أهل السنة والجماعة في تقرير مسائل الاعتقاد",
            "المصادر الأصلية لتلقي العقيدة (الكتاب-السنة-الإجماع)",
            "المصادر المساندة لتلقي العقيدة (العقل السليم-الفطرة السليمة)",
            "طرق الاستدلال عند أهل السنة والجماعة",
            "التمسك بالسنة والتحذير من البدعة",
            "ثمرات الالتزام بمنهج أهل السنة"
          ],
          "مناهج المخالفين لأهل السنة والجماعة" => [
            "مصادر تلقي العقيدة عند المخالفين إجمالًا"
          ]
        ],
        "الإيمان بالله" => [
          "توحيد الربوبية" => [
            "أدلة وجود الله",
            "الإلحاد [المراد به وصوره القديمة والمعاصرة]",
            "مناقشة أبرز الشبهات الإلحادية",
            "ثمرات الإيمان بتوحيد الربوبية",
            "أبرز المخالفين في توحيد الربوبية",
            "المراد بتوحيد الربوبية",
            "أدلة توحيد الربوبية",
            "الرد على المخالفين في توحيد الربوبية",
            "ثمرات الإيمان بالربوبية"
          ],
          "توحيد الأسماء والصفات" => [
            "المراد به",
            "باب أسماء الله تعالى",
            "باب صفات الله تعالى",
            "قواعد في أدلة الأسماء والصفات",
            "قواعد في توحيد الأسماء والصفات",
            "المراد بالإلحاد في باب الأسماء والصفات",
            "ثمرات الإيمان بالأسماء والصفات",
            "أبرز الفروق المخالفة في باب الأسماء والصفات",
            "قواعد في الرد على المخالفين في باب الأسماء والصفات",
            "باب الأسماء وباب الصفات معًا",
            "مسائل متعلقة باب الأسماء والصفات"
          ],
          "توحيد الألوهية" => [
            "المراد بتوحيد الألوهية",
            "أدلة توحيد الألوهية",
            "تعريف العبادة وأنواعها",
            "معنى [لا إله إلا الله] وأركانها وشروطها",
            "ثمرات الإيمان بتوحيد الألوهية",
            "قواعد في الرد على المخالفين في توحيد الألوهية",
            "ما يعارض توحيد الألوهية",
            "السحر",
            "الشعوذة",
            "ادعاء علم الغيب",
            "التطير",
            "التمائم",
            "التوسل",
            "التبرك",
            "الأعياد الشرعية والبدعية",
            "فضائل الأعمال",
            "المسائل المتعلقة بالقبور",
            "أعمال القلوب"
          ],
          "الإيمان بالألوهية" => [
            "الأدعية والأذكار",
            "الزهد والرقائق",
            "فضائل الأعمال",
            "الشفاعة"
          ]
        ],
        "الإيمان بالملائكة" => [
          "المراد به" => [],
          "حكمه [إجمالي وتفصيلي]" => [],
          "أدلته" => [],
          "الإيمان بوجود الملائكة وأسمائهم" => [],
          "أصناف الملائكة وأعمالهم" => [],
          "صفات الملائكة" => [],
          "ثمرات الإيمان بالملائكة" => [],
          "أبرز المخالفين في الإيمان بالملائكة" => []
        ],
        "الإيمان بالكتب" => [
          "المراد به" => [],
          "حكمه [إجمالي وتفصيلي]" => [],
          "أدلته" => [],
          "أسماء الكتب الإلهية السابقة ما حصل فيها من تحريف" => [],
          "الإيمان بالقرآن تفصيلا وخصائصه" => [],
          "أوجه الاتفاق والاختلاف بين الكتب الإلهية" => [],
          "ثمرات الإيمان بالكتب" => []
        ],
        "الإيمان بالرسل" => [
          "حكمه [إجمالي وتفصيلي]" => [],
          "أدلته" => [],
          "معنى الإيمان بالرسل السابقين إجمالا وتفصيلا" => [],
          "الوحي: تعريفه وأنواعه وأدلته" => [],
          "عصمة الأنبياء والرسل" => [],
          "دلائل وآيات النبوة" => [],
          "شمائل النبوة" => [],
          "مقتضى شهادة: [أن محمدا رسول الله]" => [],
          "خصائص النبي محمد عن غيره من الأنبياء" => [],
          "ثمرات الإيمان ب الرسل" => [],
          "مقتضى شهادة [أن محمدا رسول الله]" => ["حقوق النبي صلى الله عليه وسلم"]
        ],
        "الإيمان بالقدر" => [
          "المراد بالإيمان بالقضاء والقضار" => [],
          "حكمه [إجمالي وتفصيلي]" => [],
          "أدلته" => [],
          "مراتبه" => [],
          "أنواع الإرادة وأدلتها" => [],
          "الاحتجاج بالقدر على المصائب والمعائب" => [],
          "ثمرات الإيمان بالقدر" => [],
          "المخالفون في القدر والرد عليهم" => []
        ],
        "الإيمان باليوم الآخر" => [
          "المراد به" => [],
          "أسماؤه" => [],
          "حكمه [إجمالي وتفصيلي]" => [],
          "أدلته" => [],
          "معنى الإيمان بالبرزخ ومنازله وأدلته [فتنة القبر ونعيمه وعذابه]" => [],
          "معنى الإيمان بالروح وأدلة ذلك" => [],
          "معنى أشارط الساعة وأقسامها وأدلتها" => [],
          "معنى النفخ في الصور وأدلته" => [],
          "معنى البعث وأدلته والرد على المخالفين فيه" => [],
          "معنى الحشر وأدلته" => [],
          "معنى الحوض وأدلته والرد على من أنكره" => [],
          "معنى العرض والصحف والحساب وأدلتها" => [],
          "معنى الميزان وأدلته والرد على من أنكره" => [],
          "معنى المرور على الصراط وأحوال الناس في ذلك وأدلته" => [],
          "النار وأدلتها وما يتعلق بها من أحكام" => [],
          "الجنة وأدلتها وما يتعلق بها من أحكام" => [],
          "رؤية الله وما يتعلق بها من أحكام" => [],
          "معنى الشفاعة وأنواعها وأدلتها والرد على المخالفين فيها" => [],
          "ثمرات الإيمان باليوم الآخر" => []
        ],
        "بقية مباحث الإيمان" => [],
        "مسائل الأسماء والأحكام" => [],
        "ملحقات الاعتقاد" => [
          "الصحابة وما يتعلق بهم" => [],
          "آل البيت وما يتعلق بهم" => [],
          "كرامات الأولياء" => [],
          "الجن وما يتعلق بهم" => [],
          "الأخلاق والآداب الشرعية" => [],
          "الإمامة العظمى وأحكامها" => [],
          "الجماعة وما يتعلق بها" => []
        ],
        "مواضيع عقدية متفرقة" => [
          "مسائل التقسيمات والتفريعات" => [
            "تقسيمات متعلقة بالاعتقاد"
          ],
          "الدعوة إلى منهج السلف" => [
            "تاريخ أئمة الدعوة السلفية"
          ]
        ],
        "معتقد أهل السنة والجماعة" => [
          "أصول الاعتقاد" => [
            "مجمل الاعتقاد"
          ]
        ],
        "المصنفات في العقيدة" => []
      ],
      'الفرق' => [
        "المراد بالفرق وأنواعها وأحكامها" => [],
        "المراد بالافتراق وأنواعه" => [],
        "حكمه" => [],
        "حديث الافتراق رواية ودراية" => [],
        "الفرقة الناجية وصفاتها" => [],
        "منهج أهل السنة في التعامل مع الخلاف والمخالف العقدي" => [],
        "الخوارج" => [],
        "الشيعة" => [
          "كتب الشيعة" => [
            "نقد كتب الشيعة"
          ]
        ],
        "الجهمية (ومنهم تفرع من أنكر الصفات كالماترويدية، والمعتزلة، والأشاعرة ونحو ذلك)" => [],
        "القدرية" => [],
        "المرجئة" => [],
        "الباطنية" => [],
        "الصوفية" => [],
        "علم مقالات الفرق" => [
          "نشأة المقالات" => [
            "تدوين المقالات"
          ]
        ]
      ],
      'الأديان' => [
        "المراد بالأديان وأنواعها" => [],
        "المراد باليهودية وأقسامها وأهم عقائدها" => [],
        "المراد بالنصرانية وأقسامها وأهم عقائدها" => [],
        "المراد بالمجوسية وأهم عقائدها" => [],
        "المراد بالهندوسية وأهم عقائدها" => [],
        "المراد بالبوذية وأهم عقائدها" => [],
        "المراد بالكونفوشيوسية وأهم عقائدها" => [],
        "مقارنة الأديان" => [
          "البشارات" => [
            "البشارات بالنبي محمد صلى الله عليه وسلم"
          ]
        ]
      ],
      'المذاهب والتيارات المعاصرة' => [
        "المراد بالمذاهب المعاصرة وأنواعها" => [],
        "المذاهب المعاصرة المتعلقة بالفرق المنتسبة للإسلام" => [
          "البريلوية" => [],
          "الديوبندية" => []
        ],
        "المذاهب المعاصرة المتعلقة بالديانات والملل خارج دائرة الإسلام" => [
          "الصهيونية والماسونية وما يتعلق بهما" => [],
          "التنصير وما يتعلق به" => []
        ],
        "المذاهب والتيارات الفكرية ا لمعاصرة" => [
          "الغزو الفكري وما يتعلق به" => [],
          "التغريب وما يتعلق به" => []
        ]
      ]
    ];
  }
}
